'use script';


//Типы данных (Число и Строка)

let number = 123; // Тип данных Число
number = 1.5;

console.log(1.5 + 123); //Сложение 
console.log(1.5 - 52);  //Разность
console.log(1.5 * 52);  //Произведение
console.log(1,5 / 52);  //Деление
// Существует ножестро операций для чисел, умножение, деление, сложение, вычитание и т.д.

//Infinity представляет собой математическую бесконечность ∞. 
//Это особое значение, которое больше любого числа.
alert(1 / 0); //Infinity

//NaN означает вычислительную ошибку. 
//Это результат неправильной или неопределённой математической операции, например:
alert( "не число" / 2 + 5 ); // NaN


//Тип данных строка String

let str = 'Привет мир!'

/*В JavaScript существует три типа кавычек.
Двойные кавычки: "Привет".
Одинарные кавычки: 'Привет'.
Обратные кавычки: `Привет`.
*/


//Тип данных Булево значение

//Булевый тип (boolean) может принимать только два значения: true (истина) и false (ложь).

let myPhone = true;     //Значение Да
let youPhone = false;   //Значение Нет.